modules/neo-emacs/eglot/readme.org
#+title: Eglot for Java: jdtls, Lombok, and Jumping into Third-Party Source
#+subtitle: How neo-emacs wires Eclipse JDT LS under Eglot
#+author: van
#+date: <2026-07-17 15:33>
#+SETUPFILE: ~/.doom.d/org-classic-head.setup

* Eglot for Java

This note covers how neo-emacs runs Java under Eglot: picking jdtls, installing it, and making go-to-definition work for JDK / Maven classes that only exist as =.class= files.

** What's Eglot?

Eglot is Emacs' built-in LSP client. It does not embed language intelligence itself; it starts an external language server, speaks JSON-RPC with it, and maps the replies onto Emacs commands (=xref=, diagnostics, code actions, completion, and so on).

For Java that server is almost always [[https://github.com/eclipse/eclipse.jdt.ls][Eclipse JDT Language Server]] (the =jdtls= launcher). Eglot only needs a command on =PATH= and an entry in =eglot-server-programs=.

** Eglot workflow

=eglot-server-programs= maps major modes to server launch commands. For Java:

#+begin_src elisp
((java-mode java-ts-mode)
 . ,(eglot-alternatives '("jdtls" "java-language-server")))
#+end_src

=eglot-alternatives= tries each command in order; the first executable that exists wins. In practice that means =jdtls=.

Opening a Java buffer then looks like this:

#+begin_src txt
open Java file
      │
      ▼
java-mode / java-ts-mode
      │
      ▼
eglot-ensure
      │
      ▼
look up eglot-server-programs
      │
      ▼
resolve jdtls
      │
      ▼
start jdtls process
      │
      ▼
LSP initialize / connect
#+end_src

If =jdtls= is missing from =PATH=, Eglot has nothing to start. Fix the install before debugging Emacs config.

