modules/neo-emacs/eglot/readme.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2026-07-17 Fri 16:02 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Eglot for Java: jdtls, Lombok, and Jumping into Third-Party Source</title>
<meta name="author" content="van" />
<meta name="generator" content="Org Mode" />
<link   href = "https://cdn.minexiot.com/file/ems/base.css" rel="stylesheet" type="text/css"></link>
</head>
<body>
<div id="preamble" class="status">
<p>Made ✐︎ by 
</div>
<div id="content" class="content">
<h1 class="title">Eglot for Java: jdtls, Lombok, and Jumping into Third-Party Source
<br />
<span class="subtitle">How neo-emacs wires Eclipse JDT LS under Eglot</span>
</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#orgeb367bb">1. Eglot for Java</a>
<ul>
<li><a href="#org04ea874">1.1. What&rsquo;s Eglot?</a></li>
<li><a href="#orgf57357a">1.2. Eglot workflow</a></li>
<li><a href="#org8a9e396">1.3. Install jdtls</a></li>
<li><a href="#org9d57874">1.4. Jumping into third-party / JDK source</a></li>
<li><a href="#org21da994">1.5. Completion with Corfu</a></li>
</ul>
</li>
</ul>
</div>
</div>
<div id="outline-container-orgeb367bb" class="outline-2">
<h2 id="orgeb367bb"><span class="section-number-2">1.</span> Eglot for Java</h2>
<div class="outline-text-2" id="text-1">
<p>
This note covers how neo-emacs runs Java under Eglot: picking jdtls, installing it, and making go-to-definition work for JDK / Maven classes that only exist as <code>.class</code> files.<br />
</p>
</div>
<div id="outline-container-org04ea874" class="outline-3">
<h3 id="org04ea874"><span class="section-number-3">1.1.</span> What&rsquo;s Eglot?</h3>
<div class="outline-text-3" id="text-1-1">
<p>
Eglot is Emacs&rsquo; built-in LSP client. It does not embed language intelligence itself; it starts an external language server, speaks JSON-RPC with it, and maps the replies onto Emacs commands (<code>xref</code>, diagnostics, code actions, completion, and so on).<br />
</p>

<p>
For Java that server is almost always <a href="https://github.com/eclipse/eclipse.jdt.ls">Eclipse JDT Language Server</a> (the <code>jdtls</code> launcher). Eglot only needs a command on <code>PATH</code> and an entry in <code>eglot-server-programs</code>.<br />
</p>
</div>
</div>
<div id="outline-container-orgf57357a" class="outline-3">
<h3 id="orgf57357a"><span class="section-number-3">1.2.</span> Eglot workflow</h3>
<div class="outline-text-3" id="text-1-2">
<p>
<code>eglot-server-programs</code> maps major modes to server launch commands. For Java:<br />
</p>

<div class="org-src-container">
<pre class="src src-elisp"><code>((<span style="color: #ab98b5;">java-mode</span> java-ts-mode)
 . ,(<span style="color: #ab98b5;">eglot-alternatives</span> <span style="color: #80bcb6;">'</span>(<span style="color: #6fb593;">"jdtls"</span> <span style="color: #6fb593;">"java-language-server"</span>)))
</code></pre>
</div>

<p>
<code>eglot-alternatives</code> tries each command in order; the first executable that exists wins. In practice that means <code>jdtls</code>.<br />
</p>

<p>
Opening a Java buffer then looks like this:<br />
</p>

<div class="org-src-container">
<pre class="src src-txt"><code>open Java file
      │
      ▼
java-mode / java-ts-mode
      │
      ▼
eglot-ensure
      │
      ▼
look up eglot-server-programs
      │
      ▼
resolve jdtls
      │
      ▼
start jdtls process
      │
      ▼
LSP initialize / connect
</code></pre>
</div>

<p>
If <code>jdtls</code> is missing from <code>PATH</code>, Eglot has nothing to start. Fix the install before debugging Emacs config.<br />
</p>
</div>
</div>
