modules/neo-emacs/eglot/readme.md

# Table of Contents

1.  [Eglot for Java](#org9add88d)
    1.  [What&rsquo;s Eglot?](#org1ee32f0)
    2.  [Eglot workflow](#org0215388)
    3.  [Install jdtls](#org9718ac4)
    4.  [Jumping into third-party / JDK source](#org8cedfbf)
    5.  [Completion with Corfu](#orgcd6c72c)



<a id="org9add88d"></a>

# Eglot for Java

This note covers how neo-emacs runs Java under Eglot: picking jdtls, installing it, and making go-to-definition work for JDK / Maven classes that only exist as `.class` files.  


<a id="org1ee32f0"></a>

## What&rsquo;s Eglot?

Eglot is Emacs&rsquo; built-in LSP client. It does not embed language intelligence itself; it starts an external language server, speaks JSON-RPC with it, and maps the replies onto Emacs commands (`xref`, diagnostics, code actions, completion, and so on).  

For Java that server is almost always [Eclipse JDT Language Server](https://github.com/eclipse/eclipse.jdt.ls) (the `jdtls` launcher). Eglot only needs a command on `PATH` and an entry in `eglot-server-programs`.  


<a id="org0215388"></a>

## Eglot workflow

`eglot-server-programs` maps major modes to server launch commands. For Java:  

    ((java-mode java-ts-mode)
     . ,(eglot-alternatives '("jdtls" "java-language-server")))

`eglot-alternatives` tries each command in order; the first executable that exists wins. In practice that means `jdtls`.  

Opening a Java buffer then looks like this:  

    open Java file
          │
          ▼
    java-mode / java-ts-mode
          │
          ▼
    eglot-ensure
          │
          ▼
    look up eglot-server-programs
          │
          ▼
    resolve jdtls
          │
          ▼
    start jdtls process
          │
          ▼
    LSP initialize / connect

If `jdtls` is missing from `PATH`, Eglot has nothing to start. Fix the install before debugging Emacs config.  
