modules/neo-emacs/eglot/readme.org
** Install jdtls

There are many ways to get jdtls (package managers, =lsp-java='s downloader, etc.). I prefer the [[https://download.eclipse.org/jdtls/][official distribution]] so the version is explicit.

1. Download and unpack the archive somewhere stable, e.g. =/Users/van/lsp-java=.
2. Put its =bin= directory on =PATH=. In fish:

#+begin_src fish
set PATH /Users/van/lsp-java/bin $PATH
#+end_src

The =jdtls= entry point is a small Python script that eventually launches the OSGi-based language server JAR under a JVM. Two things usually need editing on a real machine:

- *JAVA_HOME for the server itself.* jdtls wants a recent JDK. Point the launcher at one you control.
- *Lombok.* Most Spring / enterprise codebases use it; without =-javaagent= on the server JVM, generated accessors never show up in completion or navigation.

A minimal wrapper around the stock launcher:

#+begin_src python
#!/usr/bin/env python3
import importlib.util
import sys
import os

os.environ["JAVA_HOME"] = "/Users/van/soft/jdk/jdk-25.0.2.jdk/Contents/Home"
os.environ["PATH"] = os.path.join(os.environ["JAVA_HOME"], "bin") + ":" + os.environ["PATH"]

script_dir = os.path.dirname(os.path.realpath(__file__))
file_path = os.path.join(script_dir, "jdtls.py")

spec = importlib.util.spec_from_file_location("jdtls", file_path)
jdtls = importlib.util.module_from_spec(spec)
sys.modules["jdtls"] = jdtls
spec.loader.exec_module(jdtls)

jdtls.main(sys.argv[1:])
#+end_src

Inside =jdtls.py=, the JVM argument list is where Lombok belongs:

#+begin_src python
exec_args = ["-Declipse.application=org.eclipse.jdt.ls.core.id1",
             "-Dosgi.bundles.defaultStartLevel=4",
             "-Declipse.product=org.eclipse.jdt.ls.core.product",
             "-Dosgi.checkConfiguration=true",
             "-Dosgi.sharedConfiguration.area=" + shared_config_path,
             "-Dosgi.sharedConfiguration.area.readOnly=true",
             "-Dosgi.configuration.cascaded=true",
             "-Xms1G",
             "--add-modules=ALL-SYSTEM",
             "-javaagent:/Users/van/.doom.d/neoemacs/lombok1.18.38.jar",
             "--add-opens", "java.base/java.util=ALL-UNNAMED",
             "--add-opens", "java.base/java.lang=ALL-UNNAMED"] \
            + known_args.jvm_arg \
            + ["-jar", jar_path,
               "-data", known_args.data] \
            + args
#+end_src

After that, =which jdtls= should succeed and =M-x eglot= in a Java buffer should connect without complaining about a missing server.

