modules/neo-emacs/eglot/readme.html
<div id="outline-container-org8a9e396" class="outline-3">
<h3 id="org8a9e396"><span class="section-number-3">1.3.</span> Install jdtls</h3>
<div class="outline-text-3" id="text-1-3">
<p>
There are many ways to get jdtls (package managers, <code>lsp-java</code>&rsquo;s downloader, etc.). I prefer the <a href="https://download.eclipse.org/jdtls/">official distribution</a> so the version is explicit.<br />
</p>

<ol class="org-ol">
<li>Download and unpack the archive somewhere stable, e.g. <code>/Users/van/lsp-java</code>.<br /></li>
<li>Put its <code>bin</code> directory on <code>PATH</code>. In fish:<br /></li>
</ol>

<div class="org-src-container">
<pre class="src src-fish"><code>set PATH /Users/van/lsp-java/bin $PATH
</code></pre>
</div>

<p>
The <code>jdtls</code> entry point is a small Python script that eventually launches the OSGi-based language server JAR under a JVM. Two things usually need editing on a real machine:<br />
</p>

<ul class="org-ul">
<li><b>JAVA_HOME for the server itself.</b> jdtls wants a recent JDK. Point the launcher at one you control.<br /></li>
<li><b>Lombok.</b> Most Spring / enterprise codebases use it; without <code>-javaagent</code> on the server JVM, generated accessors never show up in completion or navigation.<br /></li>
</ul>

<p>
A minimal wrapper around the stock launcher:<br />
</p>

<div class="org-src-container">
<pre class="src src-python"><code><span style="color: #545c5e;">#!/usr/bin/env python3</span>
<span style="color: #4d9391;">import</span> <span style="color: #968cc7;">importlib</span>.<span style="color: #968cc7;">util</span>
<span style="color: #4d9391;">import</span> <span style="color: #968cc7;">sys</span>
<span style="color: #4d9391;">import</span> <span style="color: #968cc7;">os</span>

<span style="color: #968cc7;">os</span>.<span style="color: #968cc7;">environ</span><span style="color: #6bd9db;">[</span><span style="color: #6fb593;">"JAVA_HOME"</span><span style="color: #6bd9db;">]</span> <span style="color: #9d81ba;">=</span> <span style="color: #6fb593;">"/Users/van/soft/jdk/jdk-25.0.2.jdk/Contents/Home"</span>
<span style="color: #968cc7;">os</span>.<span style="color: #968cc7;">environ</span><span style="color: #6bd9db;">[</span><span style="color: #6fb593;">"PATH"</span><span style="color: #6bd9db;">]</span> <span style="color: #9d81ba;">=</span> <span style="color: #968cc7;">os</span>.<span style="color: #968cc7;">path</span>.<span style="color: #80bcb6;">join</span><span style="color: #6bd9db;">(</span><span style="color: #968cc7;">os</span>.<span style="color: #968cc7;">environ</span><span style="color: #6bd9db;">[</span><span style="color: #6fb593;">"JAVA_HOME"</span><span style="color: #6bd9db;">]</span>, <span style="color: #6fb593;">"bin"</span><span style="color: #6bd9db;">)</span> <span style="color: #9d81ba;">+</span> <span style="color: #6fb593;">":"</span> <span style="color: #9d81ba;">+</span> <span style="color: #968cc7;">os</span>.<span style="color: #968cc7;">environ</span><span style="color: #6bd9db;">[</span><span style="color: #6fb593;">"PATH"</span><span style="color: #6bd9db;">]</span>

<span style="color: #968cc7;">script_dir</span> <span style="color: #9d81ba;">=</span> <span style="color: #968cc7;">os</span>.<span style="color: #968cc7;">path</span>.<span style="color: #80bcb6;">dirname</span><span style="color: #6bd9db;">(</span><span style="color: #968cc7;">os</span>.<span style="color: #968cc7;">path</span>.<span style="color: #80bcb6;">realpath</span><span style="color: #6bd9db;">(</span><span style="color: #968cc7;">__file__</span><span style="color: #6bd9db;">))</span>
<span style="color: #968cc7;">file_path</span> <span style="color: #9d81ba;">=</span> <span style="color: #968cc7;">os</span>.<span style="color: #968cc7;">path</span>.<span style="color: #80bcb6;">join</span><span style="color: #6bd9db;">(</span><span style="color: #968cc7;">script_dir</span>, <span style="color: #6fb593;">"jdtls.py"</span><span style="color: #6bd9db;">)</span>

<span style="color: #968cc7;">spec</span> <span style="color: #9d81ba;">=</span> <span style="color: #968cc7;">importlib</span>.<span style="color: #968cc7;">util</span>.<span style="color: #80bcb6;">spec_from_file_location</span><span style="color: #6bd9db;">(</span><span style="color: #6fb593;">"jdtls"</span>, <span style="color: #968cc7;">file_path</span><span style="color: #6bd9db;">)</span>
<span style="color: #968cc7;">jdtls</span> <span style="color: #9d81ba;">=</span> <span style="color: #968cc7;">importlib</span>.<span style="color: #968cc7;">util</span>.<span style="color: #80bcb6;">module_from_spec</span><span style="color: #6bd9db;">(</span><span style="color: #968cc7;">spec</span><span style="color: #6bd9db;">)</span>
<span style="color: #968cc7;">sys</span>.<span style="color: #968cc7;">modules</span><span style="color: #6bd9db;">[</span><span style="color: #6fb593;">"jdtls"</span><span style="color: #6bd9db;">]</span> <span style="color: #9d81ba;">=</span> <span style="color: #968cc7;">jdtls</span>
<span style="color: #968cc7;">spec</span>.<span style="color: #968cc7;">loader</span>.<span style="color: #80bcb6;">exec_module</span><span style="color: #6bd9db;">(</span><span style="color: #968cc7;">jdtls</span><span style="color: #6bd9db;">)</span>

<span style="color: #968cc7;">jdtls</span>.<span style="color: #80bcb6;">main</span><span style="color: #6bd9db;">(</span><span style="color: #968cc7;">sys</span>.<span style="color: #968cc7;">argv</span><span style="color: #6bd9db;">[</span><span style="color: #cd5c60;">1</span>:<span style="color: #6bd9db;">])</span>
</code></pre>
</div>

<p>
Inside <code>jdtls.py</code>, the JVM argument list is where Lombok belongs:<br />
</p>

<div class="org-src-container">
<pre class="src src-python"><code><span style="color: #968cc7;">exec_args</span> <span style="color: #9d81ba;">=</span> <span style="color: #6bd9db;">[</span><span style="color: #6fb593;">"-Declipse.application=org.eclipse.jdt.ls.core.id1"</span>,
             <span style="color: #6fb593;">"-Dosgi.bundles.defaultStartLevel=4"</span>,
             <span style="color: #6fb593;">"-Declipse.product=org.eclipse.jdt.ls.core.product"</span>,
             <span style="color: #6fb593;">"-Dosgi.checkConfiguration=true"</span>,
             <span style="color: #6fb593;">"-Dosgi.sharedConfiguration.area="</span> <span style="color: #9d81ba;">+</span> <span style="color: #968cc7;">shared_config_path</span>,
             <span style="color: #6fb593;">"-Dosgi.sharedConfiguration.area.readOnly=true"</span>,
             <span style="color: #6fb593;">"-Dosgi.configuration.cascaded=true"</span>,
             <span style="color: #6fb593;">"-Xms1G"</span>,
             <span style="color: #6fb593;">"--add-modules=ALL-SYSTEM"</span>,
             <span style="color: #6fb593;">"-javaagent:/Users/van/.doom.d/neoemacs/lombok1.18.38.jar"</span>,
             <span style="color: #6fb593;">"--add-opens"</span>, <span style="color: #6fb593;">"java.base/java.util=ALL-UNNAMED"</span>,
             <span style="color: #6fb593;">"--add-opens"</span>, <span style="color: #6fb593;">"java.base/java.lang=ALL-UNNAMED"</span><span style="color: #6bd9db;">]</span> \
            <span style="color: #9d81ba;">+</span> <span style="color: #968cc7;">known_args</span>.<span style="color: #968cc7;">jvm_arg</span> \
            <span style="color: #9d81ba;">+</span> <span style="color: #6bd9db;">[</span><span style="color: #6fb593;">"-jar"</span>, <span style="color: #968cc7;">jar_path</span>,
               <span style="color: #6fb593;">"-data"</span>, <span style="color: #968cc7;">known_args</span>.<span style="color: #968cc7;">data</span><span style="color: #6bd9db;">]</span> \
            <span style="color: #9d81ba;">+</span> <span style="color: #968cc7;">args</span>
</code></pre>
</div>

<p>
After that, <code>which jdtls</code> should succeed and <code>M-x eglot</code> in a Java buffer should connect without complaining about a missing server.<br />
</p>
</div>
</div>
