modules/neo-emacs/eglot/readme.org
** Jumping into third-party / JDK source

Plain Eglot + jdtls is enough for project sources. It falls short the moment you jump to something that lives only inside a JAR — =String=, =List=, Guava, Spring, anything without a local =.java= on disk.

jdtls still knows the type. On =textDocument/definition= it returns a custom URI:

#+begin_src txt
jdt://contents/rt.jar/java.lang/String.class?...
#+end_src

Emacs' default file handlers do not understand =jdt://=. Eglot opens the location as if it were a normal path, so go-to-definition appears broken even though the language server answered correctly.

neo-emacs closes that gap *with jdtls*, not by replacing it. The pieces:

1. *Advertise class-file support.* On initialize we send:

#+begin_src elisp
(:extendedClientCapabilities
 (:classFileContentsSupport t)
 :settings
 (:java (:configuration
         (:maven (:downloadSources t)))))
#+end_src

That tells JDT LS the client can consume class contents, and asks Maven to pull =-sources= jars when available.

2. *Register a =jdt://= file-name handler.* =file-name-handler-alist= gets an entry for =\\`jdt://=. When xref (or =find-file=) hits such a URI, control goes to =+eglot-java--jdt-uri-handler= instead of the filesystem.

3. *Ask jdtls for the text.* The handler parses the URI into a stable cache path under the project root (=.eglot-java-jdt-cache/...=). On a cache miss it issues the JDT-specific request:

#+begin_src elisp
(jsonrpc-request server :java/classFileContents (list :uri uri))
#+end_src

jdtls replies with either attached source (if a sources jar was downloaded) or a decompiled view of the =.class=. The reply is written to a =.java= file and that path is returned to Emacs.

4. *Open the cached buffer as Java.* =find-file-hook= turns those cache files into =java-ts-mode= so font-lock and editing feel normal.

So yes: navigation into third-party / JDK types still goes through *jdtls*. Eglot alone has no decompiler; neo-emacs only teaches Emacs how to open the =jdt://= locations jdtls already produces, and how to request =java/classFileContents= when the file is not cached yet.

Rough sequence:

#+begin_src txt
xref-find-definitions on String / List / library type
      │
      ▼
jdtls → Location { uri: jdt://contents/... }
      │
      ▼
Emacs open jdt://...
      │
      ▼
+eglot-java--jdt-uri-handler
      │
      ├── cache hit  → open .eglot-java-jdt-cache/...java
      │
      └── cache miss → java/classFileContents
                           │
                           ▼
                     write cache + open
#+end_src

Packages such as =lsp-java= do something similar inside lsp-mode. The neo-emacs version is the same idea adapted to Eglot's thinner client: capability flags, a URI handler, and one custom RPC.

** Completion with Corfu

Eglot's completion candidates plug into =completion-at-point-functions=, so they work with Corfu without a special bridge. =kind-icon= can sit on =corfu-margin-formatters= if you want LSP completion kinds drawn in the margin; that is purely cosmetic and unrelated to jdtls.

With jdtls on =PATH=, Lombok on the server JVM, and the =jdt://= handler installed, the day-to-day Java loop under Eglot is: open a file, get a server, jump across project and dependency code the same way.
