modules/neo-emacs/eglot/readme.html
<div id="outline-container-org9d57874" class="outline-3">
<h3 id="org9d57874"><span class="section-number-3">1.4.</span> Jumping into third-party / JDK source</h3>
<div class="outline-text-3" id="text-1-4">
<p>
Plain Eglot + jdtls is enough for project sources. It falls short the moment you jump to something that lives only inside a JAR — <code>String</code>, <code>List</code>, Guava, Spring, anything without a local <code>.java</code> on disk.<br />
</p>

<p>
jdtls still knows the type. On <code>textDocument/definition</code> it returns a custom URI:<br />
</p>

<div class="org-src-container">
<pre class="src src-txt"><code>jdt://contents/rt.jar/java.lang/String.class?...
</code></pre>
</div>

<p>
Emacs&rsquo; default file handlers do not understand <code>jdt://</code>. Eglot opens the location as if it were a normal path, so go-to-definition appears broken even though the language server answered correctly.<br />
</p>

<p>
neo-emacs closes that gap <b>with jdtls</b>, not by replacing it. The pieces:<br />
</p>

<ol class="org-ol">
<li><b>Advertise class-file support.</b> On initialize we send:<br /></li>
</ol>

<div class="org-src-container">
<pre class="src src-elisp"><code>(:extendedClientCapabilities
 (:classFileContentsSupport t)
 :settings
 (:java (:configuration
         (:maven (:downloadSources t)))))
</code></pre>
</div>

<p>
That tells JDT LS the client can consume class contents, and asks Maven to pull <code>-sources</code> jars when available.<br />
</p>

<ol class="org-ol">
<li><b>Register a <code>jdt://</code> file-name handler.</b> <code>file-name-handler-alist</code> gets an entry for <code>\\`jdt://</code>. When xref (or <code>find-file</code>) hits such a URI, control goes to <code>+eglot-java--jdt-uri-handler</code> instead of the filesystem.<br /></li>

<li><b>Ask jdtls for the text.</b> The handler parses the URI into a stable cache path under the project root (<code>.eglot-java-jdt-cache/...</code>). On a cache miss it issues the JDT-specific request:<br /></li>
</ol>

<div class="org-src-container">
<pre class="src src-elisp"><code>(<span style="color: #ab98b5;">jsonrpc-request</span> server :java/classFileContents (<span style="color: #ab98b5;">list</span> :uri uri))
</code></pre>
</div>

<p>
jdtls replies with either attached source (if a sources jar was downloaded) or a decompiled view of the <code>.class</code>. The reply is written to a <code>.java</code> file and that path is returned to Emacs.<br />
</p>

<ol class="org-ol">
<li><b>Open the cached buffer as Java.</b> <code>find-file-hook</code> turns those cache files into <code>java-ts-mode</code> so font-lock and editing feel normal.<br /></li>
</ol>

<p>
So yes: navigation into third-party / JDK types still goes through <b>jdtls</b>. Eglot alone has no decompiler; neo-emacs only teaches Emacs how to open the <code>jdt://</code> locations jdtls already produces, and how to request <code>java/classFileContents</code> when the file is not cached yet.<br />
</p>

<p>
Rough sequence:<br />
</p>

<div class="org-src-container">
<pre class="src src-txt"><code>xref-find-definitions on String / List / library type
      │
      ▼
jdtls → Location { uri: jdt://contents/... }
      │
      ▼
Emacs open jdt://...
      │
      ▼
+eglot-java--jdt-uri-handler
      │
      ├── cache hit  → open .eglot-java-jdt-cache/...java
      │
      └── cache miss → java/classFileContents
                           │
                           ▼
                     write cache + open
</code></pre>
</div>

<p>
Packages such as <code>lsp-java</code> do something similar inside lsp-mode. The neo-emacs version is the same idea adapted to Eglot&rsquo;s thinner client: capability flags, a URI handler, and one custom RPC.<br />
</p>
</div>
</div>
<div id="outline-container-org21da994" class="outline-3">
<h3 id="org21da994"><span class="section-number-3">1.5.</span> Completion with Corfu</h3>
<div class="outline-text-3" id="text-1-5">
<p>
Eglot&rsquo;s completion candidates plug into <code>completion-at-point-functions</code>, so they work with Corfu without a special bridge. <code>kind-icon</code> can sit on <code>corfu-margin-formatters</code> if you want LSP completion kinds drawn in the margin; that is purely cosmetic and unrelated to jdtls.<br />
</p>

<p>
With jdtls on <code>PATH</code>, Lombok on the server JVM, and the <code>jdt://</code> handler installed, the day-to-day Java loop under Eglot is: open a file, get a server, jump across project and dependency code the same way.<br />
</p>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Date: 2026-07-17 Fri 15:33</p>
<p class="author">Author: van</p>
<p class="date">Created: 2026-07-17 Fri 16:02</p>
</div>
</body>
</html>
